33/data/attachments/19b3a0127fc81fe1.txt

INFO     root:api_helper.py:33 Пользователь Jessica Murray зарегистрирован
INFO     root:api_helper.py:33 Пользователь Mike Horton зарегистрирован
INFO     root:api_helper.py:33 Пользователь Nicholas Skinner зарегистрирован
INFO     root:allure_helpers.py:82 

REQUEST POST http://localhost:8089/ws

REQUEST HEADERS {
  "User-Agent": "python-requests/2.32.3",
  "Accept-Encoding": "gzip, deflate",
  "Accept": "*/*",
  "Connection": "keep-alive",
  "Content-Type": "text/xml;charset=UTF-8",
  "Content-Length": "390"
}

REQUEST BODY <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Jessica Murray</nif:username>
            <nif:friendToBeRequested>Mike Horton</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>

RESPONSE HEADERS {
  "Accept": "text/xml, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2",
  "SOAPAction": "\"\"",
  "Content-Type": "text/xml;charset=utf-8",
  "Content-Length": "415",
  "Date": "Mon, 23 Jun 2025 09:32:55 GMT",
  "Keep-Alive": "timeout=60",
  "Connection": "keep-alive"
}

RESPONSE BODY b'<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:userResponse xmlns:ns2="niffler-userdata"><ns2:user><ns2:id>6b689eaa-7284-40aa-9024-ef349d93b4b6</ns2:id><ns2:username>Mike Horton</ns2:username><ns2:currency>RUB</ns2:currency><ns2:friendshipStatus>INVITE_SENT</ns2:friendshipStatus></ns2:user></ns2:userResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>'


INFO     root:allure_helpers.py:82 

REQUEST POST http://localhost:8089/ws

REQUEST HEADERS {
  "User-Agent": "python-requests/2.32.3",
  "Accept-Encoding": "gzip, deflate",
  "Accept": "*/*",
  "Connection": "keep-alive",
  "Content-Type": "text/xml;charset=UTF-8",
  "Content-Length": "395"
}

REQUEST BODY <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Jessica Murray</nif:username>
            <nif:friendToBeRequested>Nicholas Skinner</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>

RESPONSE HEADERS {
  "Accept": "text/xml, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2",
  "SOAPAction": "\"\"",
  "Content-Type": "text/xml;charset=utf-8",
  "Content-Length": "420",
  "Date": "Mon, 23 Jun 2025 09:32:55 GMT",
  "Keep-Alive": "timeout=60",
  "Connection": "keep-alive"
}

RESPONSE BODY b'<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:userResponse xmlns:ns2="niffler-userdata"><ns2:user><ns2:id>8bb65bc6-cc3d-4879-b782-4c19eb1e6944</ns2:id><ns2:username>Nicholas Skinner</ns2:username><ns2:currency>RUB</ns2:currency><ns2:friendshipStatus>INVITE_SENT</ns2:friendshipStatus></ns2:user></ns2:userResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>'


INFO     root:allure_helpers.py:82 

REQUEST POST http://localhost:8089/ws

REQUEST HEADERS {
  "User-Agent": "python-requests/2.32.3",
  "Accept-Encoding": "gzip, deflate",
  "Accept": "*/*",
  "Connection": "keep-alive",
  "Content-Type": "text/xml;charset=UTF-8",
  "Content-Length": "386"
}

REQUEST BODY <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>Mike Horton</nif:username>
            <nif:friendToBeAdded>Jessica Murray</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>

RESPONSE HEADERS {
  "Accept": "text/xml, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2",
  "SOAPAction": "\"\"",
  "Content-Type": "text/xml;charset=utf-8",
  "Content-Length": "413",
  "Date": "Mon, 23 Jun 2025 09:32:55 GMT",
  "Keep-Alive": "timeout=60",
  "Connection": "keep-alive"
}

RESPONSE BODY b'<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:userResponse xmlns:ns2="niffler-userdata"><ns2:user><ns2:id>d98c3eab-7130-466f-8ef4-897dbe791fc7</ns2:id><ns2:username>Jessica Murray</ns2:username><ns2:currency>RUB</ns2:currency><ns2:friendshipStatus>FRIEND</ns2:friendshipStatus></ns2:user></ns2:userResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>'


INFO     root:allure_helpers.py:82 

REQUEST POST http://localhost:8089/ws

REQUEST HEADERS {
  "User-Agent": "python-requests/2.32.3",
  "Accept-Encoding": "gzip, deflate",
  "Accept": "*/*",
  "Connection": "keep-alive",
  "Content-Type": "text/xml;charset=UTF-8",
  "Content-Length": "391"
}

REQUEST BODY <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>Nicholas Skinner</nif:username>
            <nif:friendToBeAdded>Jessica Murray</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>

RESPONSE HEADERS {
  "Accept": "text/xml, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2",
  "SOAPAction": "\"\"",
  "Content-Type": "text/xml;charset=utf-8",
  "Content-Length": "413",
  "Date": "Mon, 23 Jun 2025 09:32:55 GMT",
  "Keep-Alive": "timeout=60",
  "Connection": "keep-alive"
}

RESPONSE BODY b'<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:userResponse xmlns:ns2="niffler-userdata"><ns2:user><ns2:id>d98c3eab-7130-466f-8ef4-897dbe791fc7</ns2:id><ns2:username>Jessica Murray</ns2:username><ns2:currency>RUB</ns2:currency><ns2:friendshipStatus>FRIEND</ns2:friendshipStatus></ns2:user></ns2:userResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>'


INFO     root:allure_helpers.py:82 

REQUEST POST http://localhost:8089/ws

REQUEST HEADERS {
  "User-Agent": "python-requests/2.32.3",
  "Accept-Encoding": "gzip, deflate",
  "Accept": "*/*",
  "Connection": "keep-alive",
  "Content-Type": "text/xml;charset=UTF-8",
  "Content-Length": "378"
}

REQUEST BODY <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:friendsRequest>
            <nif:username>Jessica Murray</nif:username>
            <!--Optional:-->
            <nif:searchQuery></nif:searchQuery>
        </nif:friendsRequest>
    </soapenv:Body>
</soapenv:Envelope>

RESPONSE HEADERS {
  "Accept": "text/xml, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2",
  "SOAPAction": "\"\"",
  "Content-Type": "text/xml;charset=utf-8",
  "Content-Length": "614",
  "Date": "Mon, 23 Jun 2025 09:32:56 GMT",
  "Keep-Alive": "timeout=60",
  "Connection": "keep-alive"
}

RESPONSE BODY b'<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:usersResponse xmlns:ns2="niffler-userdata"><ns2:user><ns2:id>6b689eaa-7284-40aa-9024-ef349d93b4b6</ns2:id><ns2:username>Mike Horton</ns2:username><ns2:currency>RUB</ns2:currency><ns2:friendshipStatus>FRIEND</ns2:friendshipStatus></ns2:user><ns2:user><ns2:id>8bb65bc6-cc3d-4879-b782-4c19eb1e6944</ns2:id><ns2:username>Nicholas Skinner</ns2:username><ns2:currency>RUB</ns2:currency><ns2:friendshipStatus>FRIEND</ns2:friendshipStatus></ns2:user></ns2:usersResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>'